In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:password@localhost:3306/md_water_services_two

'Connected: root@md_water_services_two'

In [7]:
%%sql

# To show all the tables in the database
SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
8 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

In [13]:
%%sql


SELECT * FROM md_water_services.data_dictionary;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
49 rows affected.

[('employee', 'assigned_employee_id', 'Unique ID assigned to each employee', 'INT', 'visits'),
 ('employee', 'employee_name', 'Name of the employee', 'VARCHAR(255)', ''),
 ('employee', 'phone_number', 'Contact number of the employee', 'VARCHAR(15)', ''),
 ('employee', 'email', 'Email address of the employee', 'VARCHAR(255)', ''),
 ('employee', 'address', 'Residential address of the employee', 'VARCHAR(255)', ''),
 ('employee', 'town_name', 'Name of the town where the employee resides', 'VARCHAR(255)', ''),
 ('employee', 'province_name', 'Name of the province where the employee resides', 'VARCHAR(255)', ''),
 ('employee', 'position', 'Position or job title of the employee', 'VARCHAR(255)', ''),
 ('visits', 'record_id', 'Unique ID assigned to each visit', 'int', 'water_quality, water_source'),
 ('visits', 'location_id', 'ID of the location visited', 'varchar(255)', 'location'),
 ('visits', 'source_id', 'ID of the water source visited', 'varchar(510)', 'well_pollution'),
 ('visits', 'time_of_record', 'Date and time of the visit', 'datetime', ''),
 ('visits', 'visit_count', 'Number of visits made to this location', 'int', ''),
 ('visits', 'time_in_queue', 'Time spent by people waiting for water in a queue at the location', 'int', ''),
 ('visits', 'assigned_employee_id', 'ID of the employee who visited the location', 'int', 'employee'),
 ('water_quality', 'record_id', 'Unique ID assigned to each record', 'int', ''),
 ('water_quality', 'subjective_quality_score', 'Score representing the subjective quality of the water source', 'int', ''),
 ('water_quality', 'visit_count', 'Number of visits made for data collection', 'int', ''),
 ('water_source', 'source_id', 'Unique ID assigned to each water source', 'VARCHAR(510)', 'visits'),
 ('water_source', 'type_of_water_source', 'Type or category of the water source. Can be : tap_in_home, tap_in_home_broken, well, shared_tap, river', 'VARCHAR(255)', ''),
 ('water_source', 'number_of_people_served', 'Number of people served by this water source', 'INT', ''),
 ('well_pollution', 'source_id', 'ID of the water source being tested for pollution', 'varchar(258)', 'visits'),
 ('well_pollution', 'date', 'Date of the pollution test', 'datetime', ''),
 ('well_pollution', 'description', 'Description of the pollution test', 'varchar(255)', ''),
 ('well_pollution', 'pollutant_ppm', 'Result of the pollution test in parts per million', 'float', ''),
 ('well_pollution', 'biological', 'Biological contamination level', 'float', ''),
 ('well_pollution', 'results', "Result of the pollution test. Can be 'dirty', 'biologically contaminated', or 'clean'", 'varchar(255)', ''),
 ('location', 'location_id', 'Unique ID assigned to each location', 'varchar(255)', 'visits'),
 ('location', 'address', 'Address of the location', 'varchar(255)', ''),
 ('location', 'province_name', 'Name of the province where the location is situated', 'varchar(255)', ''),
 ('location', 'town_name', 'Name of the town where the location is situated', 'varchar(255)', ''),
 ('location', 'location_type', 'Type or category of the location', 'varchar(255)', ''),
 ('global_water_access', 'name', 'The country or area name', 'varchar(255)', ''),
 ('global_water_access', 'region', 'Geographical region', 'varchar(255)', ''),
 ('global_water_access', 'year', 'Year of the data record', 'int', ''),
 ('global_water_access', 'pop_n', 'The national population size estimate in thousands', 'float', ''),
 ('global_water_access', 'pop_u', 'The urban population share estimate in percentage points (%)', 'float', ''),
 ('global_water_access', 'wat_bas_n', 'The estimated national share of people with at least basic service (%)', 'float', ''),
 ('global_water_access', 'wat_lim_n', 'The estimated national share of people with limited service (%)', 'float', ''),
 ('global_water_access', 'wat_unimp_n', 'The estimated national share of people with unimproved service (%)', 'float', ''),
 ('global_water_access', 'wat_sur_n', 'The estimated national share of people with surface service (%)', 'float', ''),
 ('global_water_access', 'wat_bas_r', 'The estimated rural share of people with at least basic service (%)', 'float', ''),
 ('global_water_access', 'wat_lim_r', 'The estimated rural share of people with limited service (%)', 'float', ''),
 ('global_water_access', 'wat_unimp_r', 'The estimated rural share of people with unimproved service (%)', 'float', ''),
 ('global_water_access', 'wat_sur_r', 'The estimated rural share of people with surface service (%)', 'float', ''),
 ('global_water_access', 'wat_bas_u', 'The estimated urban share of people with at least basic service (%)', 'float', ''),
 ('global_water_access', 'wat_lim_u', 'The estimated urban share of people with limited service (%)', 'float', ''),
 ('global_water_access', 'wat_unimp_u', 'The estimated urban share of people with unimproved service (%)', 'float', ''),
 ('global_water_access', 'wat_sur_u', 'The estimated urban share of people with surface service (%)', 'float', '')]

In [14]:
%%sql

SELECT * FROM md_water_services.location LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
5 rows affected.

[('AkHa00000', '2 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00001', '10 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00002', '9 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00003', '139 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00004', '17 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban')]

In [16]:
%%sql

SELECT * FROM md_water_services.visits LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
5 rows affected.

[(0, 'SoIl32582', 'SoIl32582224', datetime.datetime(2021, 1, 1, 9, 10), 1, 15, 12),
 (1, 'KiRu28935', 'KiRu28935224', datetime.datetime(2021, 1, 1, 9, 17), 1, 0, 46),
 (2, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 1, 9, 36), 1, 62, 40),
 (3, 'AkLu01628', 'AkLu01628224', datetime.datetime(2021, 1, 1, 9, 53), 1, 0, 1),
 (4, 'AkRu03357', 'AkRu03357224', datetime.datetime(2021, 1, 1, 10, 11), 1, 28, 14)]

In [17]:
%%sql

SELECT * FROM md_water_services.water_source LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
5 rows affected.

[('AkHa00000224', 'tap_in_home', 956),
 ('AkHa00001224', 'tap_in_home_broken', 930),
 ('AkHa00002224', 'tap_in_home_broken', 486),
 ('AkHa00003224', 'well', 364),
 ('AkHa00004224', 'tap_in_home_broken', 942)]

In [18]:
%%sql

SELECT * FROM md_water_services.water_quality LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
5 rows affected.

[(0, 0, 1), (1, 1, 1), (2, 5, 1), (3, 10, 1), (4, 4, 1)]

### Employee table. It has info on all of our workers, but note that the email addresses have not been added. We will have to send them reports and figures, so let's update it. Luckily the emails for our department are easy: first_name.last_name@ndogowater.gov.

In [24]:
%%sql


SELECT * FROM md_water_services.employee LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
5 rows affected.

[(0, 'Amara Jengo', '+99637993287 ', None, '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786 ', None, '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041 ', None, '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900 ', None, '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640 ', None, '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [56]:
%%sql

SELECT
    employee_name,
    LENGTH(employee_name) AS string_length,
    POSITION(' ' IN employee_name) AS post_first_name,
    LEFT(employee_name, POSITION(' ' IN employee_name) -1) AS first_name,
    LENGTH(LEFT(employee_name, POSITION(' ' IN employee_name) -1)) AS first_name_len
FROM 
    md_water_services.employee LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
10 rows affected.

[('Amara Jengo', 11, 6, 'Amara', 5),
 ('Bello Azibo', 11, 6, 'Bello', 5),
 ('Bakari Iniko', 12, 7, 'Bakari', 6),
 ('Malachi Mavuso', 14, 8, 'Malachi', 7),
 ('Cheche Buhle', 12, 7, 'Cheche', 6),
 ('Zuriel Matembo', 14, 7, 'Zuriel', 6),
 ('Deka Osumare', 12, 5, 'Deka', 4),
 ('Lalitha Kaburi', 14, 8, 'Lalitha', 7),
 ('Enitan Zuri', 11, 7, 'Enitan', 6),
 ('Farai Nia', 9, 6, 'Farai', 5)]

In [59]:
%%sql

SELECT
    employee_name,
    LENGTH(employee_name) AS string_length,

    SUBSTRING(
        employee_name
        FROM POSITION(' ' IN employee_name) + 1
    ) AS last_name,

    LENGTH(
        SUBSTRING(
            employee_name
            FROM POSITION(' ' IN employee_name) + 1
        )
    ) AS last_name_len

FROM md_water_services.employee
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
10 rows affected.

[('Amara Jengo', 11, 'Jengo', 5),
 ('Bello Azibo', 11, 'Azibo', 5),
 ('Bakari Iniko', 12, 'Iniko', 5),
 ('Malachi Mavuso', 14, 'Mavuso', 6),
 ('Cheche Buhle', 12, 'Buhle', 5),
 ('Zuriel Matembo', 14, 'Matembo', 7),
 ('Deka Osumare', 12, 'Osumare', 7),
 ('Lalitha Kaburi', 14, 'Kaburi', 6),
 ('Enitan Zuri', 11, 'Zuri', 4),
 ('Farai Nia', 9, 'Nia', 3)]

 * mysql+pymysql://root:***@localhost:3306/md_water_services_two
10 rows affected.

[('Amara Jengo', 11, 6, 'Jengo', 5),
 ('Bello Azibo', 11, 6, 'Azibo', 5),
 ('Bakari Iniko', 12, 7, 'Iniko', 5),
 ('Malachi Mavuso', 14, 8, 'Mavuso', 6),
 ('Cheche Buhle', 12, 7, 'Buhle', 5),
 ('Zuriel Matembo', 14, 7, 'Matembo', 7),
 ('Deka Osumare', 12, 5, 'Osumare', 7),
 ('Lalitha Kaburi', 14, 8, 'Kaburi', 6),
 ('Enitan Zuri', 11, 7, 'Zuri', 4),
 ('Farai Nia', 9, 6, 'Nia', 3)]